{"jobs":[{"id":"c97d9f0f-4809-4d2f-80a5-aea4d7c5a479","url":"https://jobs.lever.co/economicmodeling/c97d9f0f-4809-4d2f-80a5-aea4d7c5a479","job_title":"Account Manager, Higher Education","description":"Provide top notch customer service experience and maximize customer success with our products. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"b18b606e-bc98-443b-ab72-852cedd71776","url":"https://jobs.lever.co/economicmodeling/b18b606e-bc98-443b-ab72-852cedd71776","job_title":"Data Engineer","description":"We are looking for a highly motivated data engineer who will find optimal ways to process and enrich messy user-submitted data which will help us better answer questions about the workforce, educational programs, and job opportunities. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder. ","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"2236a017-a4ba-45ae-b75c-2ced903572fb","url":"https://jobs.lever.co/economicmodeling/2236a017-a4ba-45ae-b75c-2ced903572fb","job_title":"Data Engineer, Web Scraping","description":"Emsi is looking for a Data Engineer to work on the Web Scraping team. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"d4bf3a63-0a62-4b5d-b2d1-15b20ed74180","url":"https://jobs.lever.co/economicmodeling/d4bf3a63-0a62-4b5d-b2d1-15b20ed74180","job_title":"Software Engineer","description":"Emsi is looking for a skilled software engineer to work on the Classifiers & Extractors team.  This team builds and maintains high-performance text extraction and classification libraries used to analyze job postings, resumes, and similar documents.  In addition to the machine learning solutions, this team also produces the internal tooling and data pipelines to support teams of taxonomists and curators working to continuously improve Emsi’s classifications and libraries.","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"3e4d2eca-5bc7-4309-b27d-373938c1ce59","url":"https://jobs.lever.co/economicmodeling/3e4d2eca-5bc7-4309-b27d-373938c1ce59","job_title":"Full Stack Web Developer","description":"Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need an experienced developer to join us in producing premier software tools for understanding labor market data. ","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"3b6c3fe9-ba9c-4193-9990-7b9f3d12f9ab","url":"https://jobs.lever.co/economicmodeling/3b6c3fe9-ba9c-4193-9990-7b9f3d12f9ab","job_title":"Lead Software Engineer","description":"Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need a senior front end developer to lead a small team that will build new data-heavy web applications.","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"53b36bf2-ebe0-412b-aec2-bc0c4ab2345d","url":"https://jobs.lever.co/economicmodeling/53b36bf2-ebe0-412b-aec2-bc0c4ab2345d","job_title":"Financial Analyst","description":"The Financial Analyst is part of the Emsi finance team and plays a crucial role in our execution of growth initiatives and constant innovation around optimizing and evaluating existing revenue and expenditure. Success in the role will require a mastery of our culture, history and operating principles to help ensure","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"e290ee6d-59f1-4736-93cb-d638e63e97e6","url":"https://jobs.lever.co/economicmodeling/e290ee6d-59f1-4736-93cb-d638e63e97e6","job_title":"Sr. Talent Acquisition Specialist","description":"Location: Moscow, ID","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"912d55ec-0246-4095-8c81-bbc993a1fd8b","url":"https://jobs.lever.co/economicmodeling/912d55ec-0246-4095-8c81-bbc993a1fd8b","job_title":"Corporate Counsel","description":"Emsi is a fast-growing labor market data and analytics company headquartered in Moscow, Idaho. We are looking to hire a full-time attorney to join our in-house legal team. ","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"681f7555-a1eb-4f1b-b7b3-d979c21e9a22","url":"https://jobs.lever.co/economicmodeling/681f7555-a1eb-4f1b-b7b3-d979c21e9a22","job_title":"Graphic Design Intern","description":"In this role you would work with the Marketing team to produce data visualizations, infographics, and page layouts. This role will primarily involve the design and layout of Economic Impact Studies for the higher ed consulting team but can transition into additional design and layout opportunities. A successful candidate will bring a desire to learn, a strict attention to detail, ability to meet deadlines, a basic understanding of translating numbers into graphs and charts, and an eye for page design and typography. ","location":"Moscow, ID","demand":"Full Time Internship","company":"EMSI"},{"id":"526ae978-4794-49b5-b46a-1196ad606e93","url":"https://jobs.lever.co/economicmodeling/526ae978-4794-49b5-b46a-1196ad606e93","job_title":"Graphic Designer","description":"In this role you would work with the Marketing team to produce corporate design pieces such as blog graphics, product brochures, PowerPoint presentations, data visualizations, etc. Due to the wide variety of project types, this role requires a broad knowledge of design principles and tools, as well as an eagerness to learn and develop new skills.  ","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"e5382e42-7d63-49dc-9ad1-ac8c215b6453","url":"https://jobs.lever.co/economicmodeling/e5382e42-7d63-49dc-9ad1-ac8c215b6453","job_title":"Marketing Specialist","description":"Emsi is searching for a full time (40 hr/week) Marketing Specialist to join our Talent team. This role is an opportunity to gain hands-on experience working with a CRM, managing email marketing, and executing written content.","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"c954a7bb-6312-4a9f-8168-b571458245ea","url":"https://jobs.lever.co/economicmodeling/c954a7bb-6312-4a9f-8168-b571458245ea","job_title":"Product Marketer - Emsi Skills","description":"Emsi Skills is a free website / resource that houses Emsi’s library of 30,000 skills plus an array of prototypes. The site helps people access our library and serves as a powerful entry point for much of the work we do around skills.","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"349ca93d-fcb7-494f-88a8-8f75712c8e86","url":"https://jobs.lever.co/economicmodeling/349ca93d-fcb7-494f-88a8-8f75712c8e86","job_title":"Product Manager, Global Job Postings","description":"Emsi is a leader in global labor analytics, helping a wide variety of clientele from higher education institutions to city/state governments as well as Fortune 1000 companies. We’ve built our company on the integrity of our data and the drive to be insatiably curious when it comes to solving our client’s talent issues. We’re looking for someone who is passionate about blessing customers to fill this Product role.","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"d7aa3f0f-261a-44b0-ac8f-346fff74aca6","url":"https://jobs.lever.co/economicmodeling/d7aa3f0f-261a-44b0-ac8f-346fff74aca6","job_title":"Product Specialist","description":"Provide technical expertise and support to customer needs, internal processes, and product teams.","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"912f06cf-a3af-41d2-8ee6-32655fe3ccd2","url":"https://jobs.lever.co/economicmodeling/912f06cf-a3af-41d2-8ee6-32655fe3ccd2","job_title":"Economic Analyst, Higher Education","description":"The Economic Analyst at Emsi works with the Higher Education (HE) Consulting team to produce innovative datasets, data models, visualizations, and reports that answer our clients’ most pressing problems. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"31bc3b10-224f-4f19-a3c6-e1a0a5059ead","url":"https://jobs.lever.co/economicmodeling/31bc3b10-224f-4f19-a3c6-e1a0a5059ead","job_title":"Account Executive, Universities","description":"Emsi is hiring a results-driven Account Executive who is passionate about customer success in the University market. We are looking for someone who will combine exceptional leadership and quantitative analysis skills, with the ability to work effectively in a highly dynamic environment. ","location":"Moscow, ID","demand":"Full Time","company":"EMSI"},{"id":"1999a4b5-0783-45d9-843a-e50d86263831","url":"https://jobs.lever.co/economicmodeling/1999a4b5-0783-45d9-843a-e50d86263831","job_title":"Business Development Representative","description":"Position Overview","location":"Moscow, ID","demand":"Full Time Internship","company":"EMSI"},{"id":"7e877539-d5fb-43fb-933c-a960c958501c","url":"https://jobs.lever.co/economicmodeling/7e877539-d5fb-43fb-933c-a960c958501c","job_title":"Commercial Account Executive","description":"Emsi is the leader in Enterprise big data analytics, delivering our software solutions to support mission-critical decisions for our clients.  Visit us at www.economicmodeling.com.","location":"Moscow, ID","demand":"Full Time","company":"EMSI"}]}